// 서브 데이터 JS - data.js

// const mdata ={
//     "ABOUT":["회사소개","인증서"],
//     "PRODUCTS":["SAMWHA PAPER","SMART SEARCH"],
//     "SUSTAINABILITY":["지속가능경영"],
//     "CONTACT":["고객문의","오시는 길","SNS"]
// }

let a = [{
    "emobossed" : {
            "레자크1" : {
                "영어명" : "LEATHACK1",
                "한글명" : "레자크1",
                "경로" : "./블라블라",
                "피쳐" : "어쩌구",
                "사용처" : "저쩌구",
                "무게" : "이러쿵저러쿵",
                "칼라" : ["blue","red","..."]
            },
            "레자크2" : {
                "영어명" : "LEATHACK2",
                "한글명" : "레자크2",
                "경로" : "./블라블라",
                "피쳐" : "어쩌구",
                "사용처" : "저쩌구",
                "무게" : "이러쿵저러쿵",
                "칼라" : ["blue","red","..."]
            },
            "레자크3" : {
                "영어명" : "LEATHACK3",
                "한글명" : "레자크3",
                "경로" : "./블라블라",
                "피쳐" : "어쩌구",
                "사용처" : "저쩌구",
                "무게" : "이러쿵저러쿵",
                "칼라" : ["blue","red","..."]
            },
            "레자크4" : {
                "영어명" : "LEATHACK4",
                "한글명" : "레자크4",
                "경로" : "./블라블라",
                "피쳐" : "어쩌구",
                "사용처" : "저쩌구",
                "무게" : "이러쿵저러쿵",
                "칼라" : ["blue","red","..."]
            },
            "레자크1" : {
                "영어명" : "LEATHACK1",
                "한글명" : "레자크1",
                "경로" : "./블라블라",
                "피쳐" : "어쩌구",
                "사용처" : "저쩌구",
                "무게" : "이러쿵저러쿵",
                "칼라" : ["blue","red","..."]
            },
            "레자크1" : {
                "영어명" : "LEATHACK1",
                "한글명" : "레자크1",
                "경로" : "./블라블라",
                "피쳐" : "어쩌구",
                "사용처" : "저쩌구",
                "무게" : "이러쿵저러쿵",
                "칼라" : ["blue","red","..."]
            },
            "레자크1" : {
                "영어명" : "LEATHACK1",
                "한글명" : "레자크1",
                "경로" : "./블라블라",
                "피쳐" : "어쩌구",
                "사용처" : "저쩌구",
                "무게" : "이러쿵저러쿵",
                "칼라" : ["blue","red","..."]
            },
            "레자크1" : {
                "영어명" : "LEATHACK1",
                "한글명" : "레자크1",
                "경로" : "./블라블라",
                "피쳐" : "어쩌구",
                "사용처" : "저쩌구",
                "무게" : "이러쿵저러쿵",
                "칼라" : ["blue","red","..."]
            },
            "레자크1" : {
                "영어명" : "LEATHACK1",
                "한글명" : "레자크1",
                "경로" : "./블라블라",
                "피쳐" : "어쩌구",
                "사용처" : "저쩌구",
                "무게" : "이러쿵저러쿵",
                "칼라" : ["blue","red","..."]
            },
            "레자크1" : {
                "영어명" : "LEATHACK1",
                "한글명" : "레자크1",
                "경로" : "./블라블라",
                "피쳐" : "어쩌구",
                "사용처" : "저쩌구",
                "무게" : "이러쿵저러쿵",
                "칼라" : ["blue","red","..."]
            },
            "레자크1" : {
                "영어명" : "LEATHACK1",
                "한글명" : "레자크1",
                "경로" : "./블라블라",
                "피쳐" : "어쩌구",
                "사용처" : "저쩌구",
                "무게" : "이러쿵저러쿵",
                "칼라" : ["blue","red","..."]
            },
            "레자크1" : {
                "영어명" : "LEATHACK1",
                "한글명" : "레자크1",
                "경로" : "./블라블라",
                "피쳐" : "어쩌구",
                "사용처" : "저쩌구",
                "무게" : "이러쿵저러쿵",
                "칼라" : ["blue","red","..."]
            },
    },
    "color" : {
            "레자크1" : {
                "영어명" : "LEATHACK1",
                "한글명" : "레자크1",
                "경로" : "./블라블라",
                "피쳐" : "어쩌구",
                "사용처" : "저쩌구",
                "무게" : "이러쿵저러쿵",
                "칼라" : ["blue","red","..."]
        }
    },
    "premium" : {
            "레자크1" : {
                "영어명" : "ㅊ",
                "한글명" : "레자크1",
                "경로" : "./블라블라",
                "피쳐" : "어쩌구",
                "사용처" : "저쩌구",
                "무게" : "이러쿵저러쿵",
                "칼라" : ["blue","red","..."]
        }
    },
}];

export default jeji;